pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxCpu_bf.h
/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN24 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN24_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN24 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN24_OFF (24u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN25 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN25_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN25 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN25_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN25 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN25_OFF (25u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN26 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN26_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN26 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN26_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN26 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN26_OFF (26u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN27 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN27_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN27 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN27_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN27 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN27_OFF (27u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN28 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN28_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN28 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN28_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN28 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN28_OFF (28u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN29 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN29_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN29 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN29_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN29 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN29_OFF (29u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN30 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN30_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN30 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN30_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN30 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN30_OFF (30u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN31 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN31_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN31 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN31_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENA_R_Bits.EN31 */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_R_EN31_OFF (31u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN32 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN32_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN32 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN32_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN32 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN32_OFF (0u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN33 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN33_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN33 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN33_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN33 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN33_OFF (1u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN34 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN34_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN34 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN34_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN34 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN34_OFF (2u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN35 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN35_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN35 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN35_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN35 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN35_OFF (3u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN36 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN36_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN36 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN36_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN36 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN36_OFF (4u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN37 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN37_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN37 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN37_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN37 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN37_OFF (5u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN38 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN38_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN38 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN38_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN38 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN38_OFF (6u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN39 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN39_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN39 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN39_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN39 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN39_OFF (7u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN40 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN40_LEN (1u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN40 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN40_MSK (0x1u)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN40 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN40_OFF (8u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENB_R_Bits.EN41 */
#define IFX_CPU_DLMU_SPROT_RGNACCENB_R_EN41_LEN (1u)

